Revit 2027 API
Application.VertexTolerance Property
 Vertex tolerance.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double VertexTolerance { get; }
Public ReadOnly Property VertexTolerance As Double
	Get
public:
property double VertexTolerance {
	double get ();
}
member VertexTolerance : float with get
Property Value
Double
Remarks
 Two points within this distance are considered coincident. Do not use this value for any purpose other than its intended purpose, which is to check if two points are the same within this tolerance value. Do not use this value to set the distance between two points. Doing so will result in unstable behavior.
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace